<a href="https://colab.research.google.com/github/anuragsingh24082004/FUNCTIONS-PRACTICAL/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

                                                                 **ASSIGNMENT**

Q1- CREATE A TABLE CALLED EMPLOYEES WITH THE FOLLOWING STRUCTURE:

EMP_ID (INTEGER, SHOULD NOT BE NULL AND SHOULD BE A PRIMARY KEY).
EMP_NAME (TEXT, SHOULD NOT BE NULL).
AGE (INTEGER, SHOULD HAVE A CHECK CONSTRAINT TO ENSURE THE AGE IS AT LEAST 18).
EMAIL (TEXT, SHOULD BE UNIQUE FOR EACH EMPLOYEE).
SALARY (DECIMAL, WITH A DEFAULT VALUE OF 30,000).
WRITE THE SQL QUERY TO CREATE THE ABOVE TABLE WITH ALL CONSTRAINTS.

In [14]:
#ANSWER-
import sqlite3
conn = sqlite3.connect(':memory:')
c = conn.cursor()

c.execute('''CREATE TABLE employees (
    emp_id INTEGER NOT NULL PRIMARY KEY,
    emp_name TEXT NOT NULL,
    age INTEGER NOT NULL CHECK (age >= 18),
    email TEXT UNIQUE NOT NULL,
    salary DECIMAL DEFAULT 30000
)''')

Q2- EXPLAIN THE PURPOSE OF CONSTRAINTS AND HOW THEY HELP MAINTAIN DATA INTEGRITY IN A DATABASE. PROVIDE EXAMPLES OF COMMON TYPES OF CONSTRAINTS.

ANSWER- CONSTRAINTS ARE RULES THAT ENSURE DATA IN A DATABASE IS ACCURATE, CONSISTENT, AND RELIABLE. THEY PREVENT INVALID DATA ENTRY AND ENFORCE RELATIONSHIPS BETWEEN TABLES.

COMMON CONSTRAINTS:
* PRIMARY KEY: UNIQUELY IDENTIFIES EACH RECORD.
* FOREIGN KEY: LINKS TABLES TO MAINTAIN RELATIONSHIPS.
* UNIQUE: ENSURES VALUES IN A COLUMN ARE DISTINCT.
* NOT NULL: REQUIRES A COLUMN TO HAVE A VALUE.
* CHECK: VALIDATES DATA BASED ON CONDITIONS.
* DEFAULT: PROVIDES A DEFAULT VALUE IF NONE IS GIVEN.

Q3 - WHY WOULD YOU APPLY THE NOT NULL CONSTRAINT TO A COLUMN ? CAN A PRIMARY KEY CONTAIN NUULL VALUES ? JUUSTIFY YOUR ANSWER .

ANSWER -  
* THE NOT NULL CONSTRAINT ENSURES THAT A COLUMN CANNOT HAVE NULL VALUES. IT IS APPLIED TO ENFORCE THAT A SPECIFIC FIELD MUST ALWAYS HAVE VALID DATA. FOR EXAMPLE, IN A USERS TABLE, THE USERNAME COLUMN SHOULD NOT BE NULL BECAUSE EVERY USER MUST HAVE A NAME.

* CAN A PRIMARY KEY CONTAIN NULL VALUES?  
NO, A PRIMARY KEY CANNOT CONTAIN NULL VALUES. THIS IS BECAUSE A PRIMARY KEY IS USED TO UNIQUELY IDENTIFY EACH RECORD IN A TABLE. A NULL VALUE REPRESENTS "UNKNOWN" OR "MISSING" DATA, WHICH CANNOT GUARANTEE UNIQUENESS. HENCE, PRIMARY KEYS MUST ALWAYS HAVE VALID, NON-NULL VALUES.

Q4- EXPLAIN THE STEPS AND SQL COMMANDS USED TO ADD OR REMOVE CONSTRAINTS ON AN EXISTING TABLE . PROVIDE AN EXAMPLE FOR BOTH ADDING AND REMOVING A CONSTRAINT.

ANSWER -

# STEPS USED TO ADD CONSSTRAINTS ON AN EXISTING TABLE
c.execute('''
ALTER TABLE employees
ADD CONSTRAINT employees_father_name PRIMARY KEY (father_name);
''')

Q5 - EXPLAIN THE CONSEQUENCES OF ATTEMPTING TO INSERT , UPDATE , OR DELETE DATA IN A WAY THAT VIOLATES CONSTRAINTS . PROVIDE AN EXAMPLE OF AN ERROER MESSAGE THAT MIGHT OCCUR WHEN VIOLATING A CONSTRAINT.

ANSWER - VIOLATING CONSTRAINTS DURING INSERT, UPDATE, OR DELETE OPERATIONS RESULTS IN ERRORS TO PRESERVE DATA INTEGRITY
FOR EXAMPLE - IF THERE IS ANY VIOLATION OF PRIMARY KEY BECAUSE OF THE DUPLICATE OR NULL VALUES .

Q6- YOU CREATED A PRODUUCT TABLE WITHOUT CONSTRAINTS AS FOLLOWS:

CREATE TABLE products (
  product_id INT,
  product_name VARCHAR(50),
  price DECIMAL(10,2));

NOW YOU REALISE THAT
* THE product_id SHOULD BE A PRIMARY KEY .
* THE price SHOULD HAVE A DEFAULT VALUE OF 50.00

In [ ]:
#ANSWER-
c.execute(''' CREATE TABLE products ( product_id INT, product_name VARCHAR(50), price DECIMAL(10,2)); ''')

In [ ]:
#FOR THE FIRST STATEMENT -
c.execute(''' ALTER TABLE
products ADD CONSTRAINT pk_product_id PRIMARY KEY (product_id); ''')

In [ ]:
#FOR THE SECOND STATEMENT -
c.execute(''' ALTER TABLE products ALTER COLUMN price SET DEFAULT 50.00; ''')

Q7- YOU HAVE TWO TABLES :

* STUDENTS: student_id = 1 ,2,3
student_name = Alice,Bob,Charlie
class_id = 101,102,101

* Classes: class_id = 101,102,103
class_name = Math , Science , History

WRITE A QUERY TO FETCH THE student_name AND class_name FOR EACH STUDENT USING AN INNER JOIN.

In [ ]:
#ANSWER-
c.execute(''' CREATE TABLE Students (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(50),
    class_id INT
);''')

In [ ]:
c.execute(''' INSERT INTO Students (student_id, student_name, class_id)
VALUES
(1, 'Alice', 101),
(2, 'Bob', 102),
(3, 'Charlie', 101); ''')

In [ ]:
c.execute(''' CREATE TABLE Classes (
    class_id INT PRIMARY KEY,
    class_name VARCHAR(50)
);''')

In [ ]:
c.execute('''
INSERT INTO Classes (class_id, class_name)
VALUES
(101, 'Math'),
(102, 'Science'),
(103, 'History');''')

In [ ]:
# QUERY TO FETCH STUDENT_NAME AND CLASS_NAME USING AN INNER JOIN:

c.execute(''' SELECT
    Students.student_name,
    Classes.class_name
FROM
    Students
INNER JOIN
    Classes
ON
    Students.class_id = Classes.class_id; ''')

Q8- CONSIDER THE FOLLOWING THREE TABLES:

ORDERS:

order_id = 1,2
order_date = 2024-01-01, 2024-01-03
customer_id = 101,102

Customers:

customer_id = 101,102
customer_name = Alice, Bob

Products:

product_id = 1,2
product_name = Laptop , Phone
order_id = 1 , NULL

WRITE A QUERY THAT SHOWS ALL order_id , customer_id , customer_name,AND product_name,ENSURING THAT ALL PRODUCTS ARE LISTED EVEN IF THEY ARE NOT ASSOCIATED WITH AN ORDER
HINT:(USE INNER JOIN AND LEFT JOIN ).

In [20]:
# ANSWER-
c.execute('''CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    order_date DATE,
    customer_id INT
);''')

In [21]:
c.execute('''INSERT INTO Orders (order_id, order_date, customer_id)
VALUES
(1, '2024-01-01', 101),
(2, '2024-01-03', 102);''')

In [22]:
c.execute('''CREATE TABLE Customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50)
);''')

In [23]:
c.execute('''INSERT INTO Customers (customer_id, customer_name)
VALUES
(101, 'Alice'),
(102, 'Bob');''')

In [24]:
c.execute('''CREATE TABLE Product_s (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(50),
    order_id INT
);''')

In [25]:
c.execute('''INSERT INTO Product_s (product_id, product_name, order_id)
VALUES
(1, 'Laptop', 1),
(2, 'Phone', NULL);''')

In [26]:
# QUERY USING INNER JOIN AND LEFT JOIN:(product table name is written as product_s to avoid the duplicate)
c.execute('''SELECT
    Orders.order_id,
    Orders.customer_id,
    Customers.customer_name,
    Product_s.product_name
FROM
    Product_s
LEFT JOIN
    Orders ON Product_s.order_id = Orders.order_id
LEFT JOIN
    Customers ON Orders.customer_id = Customers.customer_id;''')

Q9 - GIVEN THE FOLLOWING TABLES:

SALES:
sales_id = 1,2,3
product_id = 101,102,101
amount = 700

Products:
product_id = 101,102
product_name = Laptop , Phone

WRITE A QUERY TO FIND THE TOTAL SALES FOR EACH PRODUCT USING AN INNER JOIN AND THE SUM() FUNCTION .

In [18]:
# ANSWER -
c.execute('''
CREATE TABLE Sales (
    sales_id INTEGER PRIMARY KEY,
    product_id INTEGER,
    amount DECIMAL(10, 2)
)
''')

In [19]:
c.execute('''INSERT INTO Sales (sales_id, product_id, amount)
VALUES
(1, 101, 700),
(2, 102, 700),
(3, 101, 700); ''')

Q10 - YOU ARE GIVEN THREE TABLES:

Orders:
order_id = 1,2
order_date = 2024-01-02,2024-01-05
customer_id = 1,2

Customers:
customer_id = 1,2
customer_name = Alice,Bob

Order_Details:

order_id = 1,2,3
product_id = 101,102,101
quantity = 2,1,3

WRITE A QUERY TO DISPLAY THE order_id,customer_id,customer_name,AND THE QUANTITY OF PRODUCTS ORDERED BY EACH CUSTOMER USING AN INNER JOIN BETWEEN ALL THREE TABLES.

NOTE- THE ABOVE-MENTIONED QUESTIONS DON'T REQUIRE ANY DATASET.

In [27]:
#ANSWER - orders is written as order__s to avoid duplicate
c.execute('''CREATE TABLE Order__s (
    order_id INT PRIMARY KEY,
    order_date DATE,
    customer_id INT
);''')

c.execute('''INSERT INTO Orders (order_id, order_date, customer_id)
VALUES(1, '2024-01-02', 1),(2, '2024-01-05', 2);''')

In [ ]:

c.execute('''CREATE TABLE Orders (
    order_id INT PRIMARY KEY,
    order_date DATE,
    customer_id INT
);

INSERT INTO Orders (order_id, order_date, customer_id)
VALUES
(1, '2024-01-02', 1),
(2, '2024-01-05', 2);

-- CREATE CUSTOMERS TABLE
CREATE TABLE Customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(50)
);

INSERT INTO Customers (customer_id, customer_name)
VALUES
(1, 'Alice'),
(2, 'Bob');

-- CREATE ORDER_DETAILS TABLE
CREATE TABLE Order_Details (
    order_id INT,
    product_id INT,
    quantity INT,
    PRIMARY KEY (order_id, product_id)
);

INSERT INTO Order_Details (order_id, product_id, quantity)
VALUES
(1, 101, 2),
(2, 102, 1),
(3, 101, 3); ''')

In [ ]:
#QUERY TO DISPLAY THE ORDER DETAILS, CUSTOMER INFO, AND QUANTITY:
SELECT
    Orders.order_id,
    Orders.customer_id,
    Customers.customer_name,
    Order_Details.quantity
FROM
    Orders
INNER JOIN
    Customers ON Orders.customer_id = Customers.customer_id
INNER JOIN
    Order_Details ON Orders.order_id = Order_Details.order_id;

# **SQL COMMANDS**

Q1- IDENTIFY THE PRIMARY KEYS AND FOREIGN KEYS IN MAVEN MOVIES DB.DISCUSS THE DIFFERENCES .

ANSWER-
* PRIMARY KEYS IN MAVEN MOVIES DATABASE ARE SUCH AS -
actor_id , film_id , customer_id, inventory_id, rental_id , payment_id

* FOREIGN KEYS -

film_actor: actor_id = actor(actor_id),film_id = film(film_id)
rental: inventory = inventory(inventory_id),customer_id = customer(customer_id)
payment: rental_id = rental(rental_id),customer_id = customer(customer_id)  
inventory: film_id = film(film_id), store_id = store(store_id)

* DIFFERENCES - 1) PRIMARY KEY UNIQUELY IDENTIFIES A RECORD IN A TABLE WHERE FOREIGN KEY LINKS TWO TABLES BY REFRENCING A PRIMARY KEY .
2) PRIMARY KEY MUST BE UNIQUE FOR EACH RECORD WHERE FOREIGN KEY CAN HAVE DUPLICATE VALUES WITHN THE CHILD TABLE.
3) PRIMARY CAN NOOT BE NULL WHERE FOREIGN KEY CAN HAVE NULL VALUES.

2- LIST ALL DETAILS OF ACTORS

ANSWER -

connection = sqlite3.connect("Mavenmovies.sql")
with open("Mavenmovies.sql", "r") as sql_file:
    sql_script = sql_file.read()
cursor = connection.cursor()
c.execute('''SELECT * FROM actor;
''')

3- LIST ALL CUSTOMER INFORMATION FROM DB.

In [ ]:
 #ANSWER - c.execute('''SELECT * FROM customer;''')

4- LIST DIFFERENT COUNTRIES.

In [ ]:
#ANSWER - c.execute('''SELECT DISTINCT country FROM country;''')

5- DISPLAY ALL ACTIVE CUSTOMERS.

In [ ]:
#ANSWER- SELECT rental_id FROM rental WHERE customer_id = 1;

6- LIST OF ALL RENTAL IDs FOR CUSTOMER WITH ID 1.

In [ ]:
#ANSWER- SELECT rental_id FROM rental WHERE customer_id = 1;

7- DISPLAY ALL THE FILMS WHOSE RENTAL DURATION IS GREATER THAN 5.

In [ ]:
#ANSWER- SELECT * FROM film WHERE rental_duration > 5;

8- LIST THE TOTAL NUMBER OF FILMS WHOSE REPLACEMENT COST IS GREATER THAN $15 AND LESS THAN $20.

In [ ]:
#ANSWER- SELECT COUNT(*) FROM film WHERE replacement_cost > 15 AND replacement_cost < 20;

9- DISPLAY THE COUNT OF UNIQUE FIRST NAMES OF ACTORS.

In [ ]:
#ANSWER- SELECT COUNT(DISTINCT first_name) FROM actor;

10- DISPLAY THE FIRST 10 RECORDS FROM THE CUSTOMER TABLE .

In [ ]:
#ANSWER- SELECT * FROM customer LIMIT 10;

11- DISPLAY THE FIRST 3 RECORDS FRONM THE CUSTOMER TABLE WHOSE FIRST NAME STARTS WITH 'B'.

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE 'B%' LIMIT 3;

12- DISPLAY THE NAMES OF THE FIRST 5 MOVIES WHICH ARE RELATED AS 'G'.

In [ ]:
#ANSWER- SELECT title FROM film WHERE rating = 'G' LIMIT 5;

13- FIND ALL CUSTOMERS WHOSE FIRST NAME STARTS WITH 'a'.

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE 'A%';

14- FIND ALL CUSTOMERS WHOSE FIRST NAME ENDS WITH "A".

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE '%A';

15- DISPLAY THE LIST OF FIRST 4 CITIES WHICH STARTS AND ENDS WITH 'A'.

In [ ]:
#ANSWER- SELECT DISTINCT city FROM city WHERE city LIKE 'A%' AND city LIKE '%A' LIMIT 4;

16- FIND ALL CUSTOMERS WHOSE FIRST NAME HAVE "NI" IN ANY POSITION .

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE '%NI%';

17- FIND ALL CUSTOMERS WHOSE FIRST NAME HAVE "r" IN THE SECOND POSITION .

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE '_R%';

18- FIND ALL CUSTOMERS WHOSE FIRST NAME STARTS WITH "a" AND ARE AT LEAST 5 CHARACTERS IN LENGTH .

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE 'A%' AND LENGTH(first_name) >= 5;

19- FIND ALL CUSTOMERS WHOSE FIRST NAME STARTS WITH "a" AND ENDS WITH "o".

In [ ]:
#ANSWER- SELECT * FROM customer WHERE first_name LIKE 'A%O';

20- GET THE FILMS WITH PG AND PG-13 RATING USING IN OPERATOR.

In [ ]:
#ANSWER- SELECT * FROM film WHERE rating IN ('PG', 'PG-13');

21- GET THE FILMS WITH LENGTH BETWEEN 50 TO 100 USING BETWEEN OPERATOR.

In [ ]:
#ANSWER- SELECT * FROM film WHERE length BETWEEN 50 AND 100;

22- GET THE TOP 50 ACTORS USING LIMIT OPERATOR.

In [ ]:
#ANSWER- SELECT * FROM actor LIMIT 50;

23- GET THE DISTINCT FILM IDS FROM INVENTORY TABLE.

In [ ]:
#ANSWER- SELECT DISTINCT film_id FROM inventory;

# FUNCTIONS

Q1-RETRIEVE THE TOTAL NUMBER OF RENTALS MADE IN THE SAKILA DATABASE.

HINT: USE THE COUNT() FUNCTION.

SELECT COUNT(*) AS total_rentals
FROM rental;

Q2- FIND THE AVERAGE RENTAL DURATION (IN DAYS) OF MOVIES RENTED FROM THE SAKILA DATABASE.

HINT: UTILIZE THE AVG() FUNCTION.

ANSWER- SELECT COUNT(*) AS total_rentals
FROM rental;

Q3- DISPLAY THE FIRST NAME AND LAST NAME OF CUSTOMERS IN UPPERCASE.

HINT: USE THE UPPER() FUNCTION.

ANSWER-
SELECT UPPER(first_name) AS first_name_upper,
       UPPER(last_name) AS last_name_upper
FROM customer;

Q4- EXTRACT THE MONTH FROM THE RENTAL DATE AND DISPLAY IT ALONGSIDE THE RENTAL ID.

HINT: EMPLOY THE MONTH() FUNCTION.

ANSWER -

SELECT rental_id,
       strftime('%m', rental_date) AS rental_month
FROM rental;

Q5- RETRIEVE THE COUNT OF RENTALS FOR EACH CUSTOMER (DISPLAY CUSTOMER ID AND THE COUNT OF RENTALS).

HINT: USE COUNT() IN CONJUNCTION WITH GROUP BY.

ANSWER -

SELECT customer_id,
       COUNT(*) AS rental_count
FROM rental
GROUP BY customer_id;

Q6- FIND THE TOTAL REVENUE GENERATED BY EACH STORE.

HINT: COMBINE SUM() AND GROUP BY.

ANSWER-

SELECT store_id,
       SUM(amount) AS total_revenue
FROM payment
GROUP BY store_id;

Q7- DETERMINE THE TOTAL NUMBER OF RENTALS FOR EACH CATEGORY OF MOVIES.

HINT: JOIN FILM_CATEGORY, FILM, AND RENTAL TABLES, THEN USE COUNT() AND GROUP BY.

ANSWER -
SELECT c.name AS category_name,
       COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
GROUP BY c.name;

Q8- FIND THE AVERAGE RENTAL RATE OF MOVIES IN EACH LANGUAGE.

HINT: JOIN FILM AND LANGUAGE TABLES, THEN USE AVG() AND GROUP BY.

ANSWER -

SELECT l.name AS language_name,
       AVG(f.rental_rate) AS avg_rental_rate
FROM film f
JOIN language l ON f.language_id = l.language_id
GROUP BY l.name;

Q9- DISPLAY THE TITLE OF THE MOVIE, CUSTOMER'S FIRST NAME, AND LAST NAME WHO RENTED IT.

HINT: USE JOIN BETWEEN THE FILM, INVENTORY, RENTAL, AND CUSTOMER TABLES.

ANSWER-

SELECT f.title AS movie_title,
       c.first_name AS customer_first_name,
       c.last_name AS customer_last_name
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
JOIN customer c ON r.customer_id = c.customer_id;

Q10- RETRIEVE THE NAMES OF ALL ACTORS WHO HAVE APPEARED IN THE FILM "GONE WITH THE WIND."

HINT: USE JOIN BETWEEN THE FILM ACTOR, FILM, AND ACTOR TABLES.

ANSWER -

SELECT a.first_name AS actor_first_name,
       a.last_name AS actor_last_name
FROM film f
JOIN film_actor fa ON f.film_id = fa.film_id
JOIN actor a ON fa.actor_id = a.actor_id
WHERE f.title = 'Gone with the Wind';

Q11- RETRIEVE THE CUSTOMER NAMES ALONG WITH THE TOTAL AMOUNT THEY'VE SPENT ON RENTALS.

HINT: JOIN CUSTOMER, PAYMENT, AND RENTAL TABLES, THEN USE SUM() AND GROUP BY.

ANSWER-

SELECT c.first_name AS customer_first_name,
       c.last_name AS customer_last_name,
       SUM(p.amount) AS total_spent
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id;

Q12- LIST THE TITLES OF MOVIES RENTED BY EACH CUSTOMER IN A PARTICULAR CITY (E.G., 'LONDON').

HINT: JOIN CUSTOMER, ADDRESS, CITY, RENTAL, INVENTORY, AND FILM TABLES, THEN USE GROUP BY.

ANSWER-

SELECT c.first_name AS customer_first_name,
       c.last_name AS customer_last_name,
       f.title AS movie_title,
       ci.city AS city_name
FROM customer c
JOIN address a ON c.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN rental r ON c.customer_id = r.customer_id
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
WHERE ci.city = 'London'
GROUP BY c.customer_id, f.title;

**ADVANCED JOINS AND GROUP BY:**

Q13- DISPLAY THE TOP 5 RENTED MOVIES ALONG WITH THE NUMBER OF TIMES THEY'VE BEEN RENTED.

HINT: JOIN FILM, INVENTORY, AND RENTAL TABLES, THEN USE COUNT() AND GROUP BY, AND LIMIT THE RESULTS.

ANSWER-

SELECT f.title AS movie_title,
       COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;

Q14- DETERMINE THE CUSTOMERS WHO HAVE RENTED MOVIES FROM BOTH STORES (STORE ID 1 AND STORE ID 2).

HINT: USE JOINS WITH RENTAL, INVENTORY, AND CUSTOMER TABLES AND CONSIDER COUNT() AND GROUP BY.

ANSWER-

SELECT f.title AS movie_title,
       COUNT(r.rental_id) AS rental_count
FROM rental r
JOIN inventory i ON r.inventory_id = i.inventory_id
JOIN film f ON i.film_id = f.film_id
GROUP BY f.title
ORDER BY rental_count DESC
LIMIT 5;

# WINDOWS FUNCTION:

Q1 - RANK THE CUSTOMERS BASED ON THE TOTAL AMOUNT THEY'VE SPENT ON RENTALS.

ANSWER -

SELECT c.customer_id,
       c.first_name,
       c.last_name,
       SUM(p.amount) AS total_spent,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS rank
FROM customer c
JOIN payment p ON c.customer_id = p.customer_id
GROUP BY c.customer_id;

Q2- CALCULATE THE CUMULATIVE REVENUE GENERATED BY EACH FILM OVER TIME.

ANSWER - SELECT f.title AS movie_title,
       p.payment_date,
       SUM(p.amount) OVER (PARTITION BY f.film_id ORDER BY p.payment_date) AS cumulative_revenue
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
JOIN payment p ON r.rental_id = p.rental_id;

Q3- DETERMINE THE AVERAGE RENTAL DURATION FOR EACH FILM, CONSIDERING FILMS WITH SIMILAR LENGTHS.

ANSWER - SELECT f.title AS movie_title,
       f.length AS film_length,
       AVG(julianday(r.return_date) - julianday(r.rental_date)) OVER (PARTITION BY f.length) AS avg_rental_duration
FROM film f
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id;

Q4- IDENTIFY THE TOP 3 FILMS IN EACH CATEGORY BASED ON THEIR RENTAL COUNTS .

ANSWER -

SELECT c.name AS category_name,
       f.title AS movie_title,
       COUNT(r.rental_id) AS rental_count,
       RANK() OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) AS rank
FROM film f
JOIN film_category fc ON f.film_id = fc.film_id
JOIN category c ON fc.category_id = c.category_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.category_id, f.film_id
HAVING rank <= 3;

Q5- FIND THE MONTHLY REVENUE TREND FOR THE ENTIRE RENTAL STORE OVER TIME.

ANSWER -

SELECT strftime('%Y-%m', p.payment_date) AS month,
       SUM(p.amount) AS monthly_revenue
FROM payment p
GROUP BY month
ORDER BY month;

Q6- IDENTIFY THE CUSTOMERS WHOSE TOTAL SPENDING ON RENTALS FALLS WITHIN THE TOP 20% OF ALL CUSTOMERS.

ANSWER -

WITH customer_spending AS (
    SELECT c.customer_id,
           c.first_name,
           c.last_name,
           SUM(p.amount) AS total_spent
    FROM customer c
    JOIN payment p ON c.customer_id = p.customer_id
    GROUP BY c.customer_id
),
spending_percentiles AS (
    SELECT total_spent,
           PERCENT_RANK() OVER (ORDER BY total_spent DESC) AS spending_rank
    FROM customer_spending
)
SELECT cs.customer_id,
       cs.first_name,
       cs.last_name,
       cs.total_spent
FROM customer_spending cs
JOIN spending_percentiles sp ON cs.total_spent = sp.total_spent
WHERE sp.spending_rank >= 0.8;

Q7- CALCULATE THE RUNNING TOTAL OF RENTALS PER CATEGORY, ORDERED BY RENTAL COUNT.

ANSWER -

SELECT c.name AS category_name,
       COUNT(r.rental_id) AS rental_count,
       SUM(COUNT(r.rental_id)) OVER (PARTITION BY c.category_id ORDER BY COUNT(r.rental_id) DESC) AS running_total
FROM category c
JOIN film_category fc ON c.category_id = fc.category_id
JOIN film f ON fc.film_id = f.film_id
JOIN inventory i ON f.film_id = i.film_id
JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY c.category_id, f.film_id;
w

Q8- FIND THE FILMS THAT HAVE BEEN RENTED LESS THAN THE AVERAGE RENTAL COUNT FOR THEIR RESPECTIVE CATEGORIES.

ANSWER -

WITH category_rentals AS (
    SELECT c.category_id,
           c.name AS category_name,
           f.film_id,
           f.title AS movie_title,
           COUNT(r.rental_id) AS rental_count
    FROM category c
    JOIN film_category fc ON c.category_id = fc.category_id
    JOIN film f ON fc.film_id = f.film_id
    JOIN inventory i ON f.film_id = i.film_id
    JOIN rental r ON i.inventory_id = r.inventory_id
    GROUP BY c.category_id, f.film_id
),
category_avg AS (
    SELECT category_id,
           AVG(rental_count) AS avg_rental_count
    FROM category_rentals
    GROUP BY category_id
)
SELECT cr.category_name,
       cr.movie_title,
       cr.rental_count
FROM category_rentals cr
JOIN category_avg ca ON cr.category_id = ca.category_id
WHERE cr.rental_count < ca.avg_rental_count;
```

Q9- IDENTIFY THE TOP 5 MONTHS WITH THE HIGHEST REVENUE AND DISPLAY THE REVENUE GENERATED IN EACH MONTH.

ANSWER - SELECT strftime('%Y-%m', p.payment_date) AS month,
       SUM(p.amount) AS revenue,
       RANK() OVER (ORDER BY SUM(p.amount) DESC) AS rank
FROM payment p
GROUP BY month
HAVING rank <= 5;

Q10- CALCULATE THE DIFFERENCE IN RENTAL COUNTS BETWEEN EACH CUSTOMER'S TOTAL RENTALS AND THE AVERAGE RENTALS ACROSS ALL CUSTOMERS.

ANSWER - WITH customer_rental_counts AS (
    SELECT c.customer_id,
           c.first_name,
           c.last_name,
           COUNT(r.rental_id) AS total_rentals
    FROM customer c
    JOIN rental r ON c.customer_id = r.customer_id
    GROUP BY c.customer_id
),
average_rentals AS (
    SELECT AVG(total_rentals) AS avg_rentals
    FROM customer_rental_counts
)
SELECT crc.customer_id,
       crc.first_name,
       crc.last_name,
       crc.total_rentals,
       (crc.total_rentals - ar.avg_rentals) AS rental_difference
FROM customer_rental_counts crc
CROSS JOIN average_rentals ar;

# NORMALISATION AND CTE

Q1 - FIRST NORMAL FORM (1NF):

A. IDENTIFY A TABLE IN THE SAKILA DATABASE THAT VIOLATES 1NF. EXPLAIN HOW YOU WOULD NORMALIZE IT TO ACHIEVE 1NF.

Q2- SECOND NORMAL FORM (2NF):

A. CHOOSE A TABLE IN SAKILA AND DESCRIBE HOW YOU WOULD DETERMINE WHETHER IT IS IN 2NF.

IF IT VIOLATES 2NF, EXPLAIN THE STEPS TO NORMALIZE IT.

Q3- THIRD NORMAL FORM (3NF):

A. IDENTIFY A TABLE IN SAKILA THAT VIOLATES 3NF. DESCRIBE THE TRANSITIVE DEPENDENCIES PRESENT AND OUTLINE THE STEPS TO NORMALIZE THE TABLE TO 3NF.

Q4- NORMALIZATION PROCESS:

A. TAKE A SPECIFIC TABLE IN SAKILA AND GUIDE THROUGH THE PROCESS OF NORMALIZING IT FROM THE INITIAL UNNORMALIZED FORM UP TO AT LEAST 2NF.

Q5- CTE BASICS:

A. WRITE A QUERY USING A CTE TO RETRIEVE THE DISTINCT LIST OF ACTOR NAMES AND THE NUMBER OF FILMS THEY HAVE ACTED IN FROM THE ACTOR AND FILM_ACTOR TABLES.

Q6- CTE WITH JOINS:

A. CREATE A CTE THAT COMBINES INFORMATION FROM THE FILM AND LANGUAGE TABLES TO DISPLAY THE FILM TITLE, LANGUAGE NAME, AND RENTAL RATE.

Q7- CTE FOR AGGREGATION:

A. WRITE A QUERY USING A CTE TO FIND THE TOTAL REVENUE GENERATED BY EACH CUSTOMER (SUM OF PAYMENTS) FROM THE CUSTOMER AND PAYMENT TABLES.

Q8- CTE WITH WINDOW FUNCTIONS:

A. UTILIZE A CTE WITH A WINDOW FUNCTION TO RANK FILMS BASED ON THEIR RENTAL DURATION FROM THE FILM TABLE.

Q9- CTE AND FILTERING:

A. CREATE A CTE TO LIST CUSTOMERS WHO HAVE MADE MORE THAN TWO RENTALS, AND THEN JOIN THIS CTE WITH THE CUSTOMER TABLE TO RETRIEVE ADDITIONAL CUSTOMER DETAILS.

Q10- CTE FOR DATE CALCULATIONS:

A. WRITE A QUERY USING A CTE TO FIND THE TOTAL NUMBER OF RENTALS MADE EACH MONTH, CONSIDERING THE RENTAL_DATE FROM THE RENTAL TABLE

Q11- CTE AND SELF-JOIN:

A. CREATE A CTE TO GENERATE A REPORT SHOWING PAIRS OF ACTORS WHO HAVE APPEARED IN THE SAME FILM TOGETHER, USING THE FILM_ACTOR TABLE.

Q12- CTE FOR RECURSIVE SEARCH:
A. IMPLEMENT A RECURSIVE CTE TO FIND ALL EMPLOYEES IN THE STAFF TABLE WHO REPORT TO A SPECIFIC MANAGER, CONSIDERING THE REPORTS_TO COLUMN